{"pageProps":{"posts":[{"slug":"2022-12-25","title":"The Making of 'A Noble Pursuit': A Postmortem","date":"Sun Dec 25 2022","image":"https://images.unsplash.com/photo-1579403124614-197f69d8187b?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=500&h=500&q=30","content":"# The Making of A Noble Pursuit: A Postmortem 📕\n\n<h3 id=\"why-i-started-writing\">How It All Started ❓</h3>\n\n[A Noble Pursuit](https://thejayduck.itch.io/a-noble-pursuit) is a visual novel about a noble girl named Carolina, and her dream of becoming a merchant.\n\nThe game was developed over the course of two months for the [Winter Visual Novel Jam 2022](https://itch.io/jam/winter-vn-jam-2022). I usually tackle game jams with my friends, but this time I wanted to improve my skills, particularly writing.\n\n</br>\n\nA month before the jam started, I had already participated in [Spooky 2D Jam '22](https://itch.io/jam/spooky-2d-jam-2022/) so I was rather reluctant to join yet another game jam right after.\n\nBut thanks to my friend [crissNb](https://crissnb.github.io/), who is a brilliant Unity developer, encouraged me to join it nonetheless. And so I did!\n\n<h3 id=\"pre-production\">Pre-Production ⚙️</h3>\n\nOn the 6th of November, I began the pre-production phase of the game, which consisted of writing the draft, and drawing the characters that were going to take place.\n\n</br>\n\nSince I am quite new to the world of writing I began to experiment by writing my draft in a screenplay fashion. My initial writing goal was to have around 2.5k words (~15 Minutes of Playtime), but in the middle of November, I had already written 6000 words and had only reached the climax of the game. Props to [crissNb](https://crissnb.github.io/) for helping me come up with ideas throughout the drafting phase.\n\n</br>\n\nAnyways, the writing was going surprisingly well, drawing on the other hand... well let's say I had to redraw certain all characters a few times. More on that in the upcoming part.\n\n<h3 id=\"production\">Production 🖥️</h3>\n\nA few days before the game jam officially started, I had completed my draft and base character sprites. Things were going terrifyingly well, and spoilers, everything went super well afterward.\n\n</br>\n\nBefore starting to edit the story I took a week-long break from writing. Meanwhile, I focused on *ahem* redrawing every character. You might ask \"But why?\", here's the thing, I managed to improve my art style considerably during the pre-production phase, which led me into hating my previous works. And so, I redrew; Carolina 20 times (I redrew her base 4 times, and had to redraw her 4 unique outfits once more.), Hulderic 3 times, and recolor Alexandra, Ubel, and Benjamin to fit the new art style. Weirdly enough, I did enjoy redrawing, mainly because I had improved so much within a short time frame.\n\n</br>\n\nWhen I finally finished, a week had already passed, which implied it was time for me to take a look at the... ***awful*** draft. How in the world does one write such a terrible story? I was discouraged by this, to the point of almost rewriting the draft. But luckily I stumbled upon various posts about how \" the first draft sucks\" and so on.\n\n</br>\n\nWith a glimmer of hope I put my trust into the editing process and created a new document. This time I decided to write it Ren'Py format, in order to make the transition into the game script as simple as 'Ctrl+C' and 'Ctrl+V'. And ***WOW*** editing really did make the story more interesting and fun to read! But I still needed an extra pair of eyes, and by that I mean the help of [Avellox](https://avellox.itch.io/). She helped me by pointing out the mistakes, the areas I could improve, and some additional content.\n\n</br>\n\nThe editing process took around 2 weeks, and during that time I started redrawing the CG for 'Act 4'. Yes \"Redrawing\". Before I had redrawn Carolina in a way where her design had changed, I had the CG completed. So I needed to redraw it with her new design. I thought I could get away by drawing over her old design but it didn't look right. So I redrew it completely once more, which had an awful lineart. Remember how I said redrawing characters was fun, this wasn't... I felt frustrated once more feeling inferior about my art. I had to learn more about lineart, and began the search for youtube tutorials. After spending roughly a day learning about lineart, I managed to draw lineart like I never did before, thank you [Marc Brunet](https://youtube.com/channel/UCKtu_JtQCY0yryIy6zK4ZCg)!\n\n</br>\n\nI would explain the process of transitioning my edited script into Ren'Py but like I mentioned before it was easy as copying and pasting.\n\n</br>\n\nAnd so came an end... Wait no, not yet, I still had to draw an extra sketch for the people who buy the 'Art Pack'. The same process happened as the characters, I redrew it a good 6 times. Thankfully it was only the poses I had drawn, so it didn't take a toll on me.\n\n<h3 id=\"conclusion\">Conclusion</h3>\n\nOverall, I am very happy with how the game turned out. While it was a challenge to tackle the game by myself, I am astonished by the improvements in my writing and drawing.\n\nThank you much for reading my lengthy rambling, and I hope you enjoyed playing this game!\n\n</br>\n\n[You Can Play The Game By Clicking Here](https://thejayduck.itch.io/a-noble-pursuit)"},{"slug":"2022-09-14","title":"Custom Deck of Cards Part 4","date":"Wed Sep 14 2022","image":"https://images.unsplash.com/photo-1541278107931-e006523892df?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=500&h=500&q=30","content":"\n# Custom Deck of Cards Part 4\n\n<h3 id=\"that-was-fast\"> That Was Fast 🏃‍♂️ </h3>\n\nDrawing the first half of the character cast took... 9 days in total. Don't get me wrong this progress is pretty darn good, but I am still shocked at my own speed. This progress might slow down on the upcoming weeks, or even days, because of good circumstances. But I doubt it will take longer than a month.\n\n<h3 id=\"first-half\"> The First Half ➗ </h3>\n\n|🂡 Ace|🂮 King|🂫 Jack|🂭 Queen|🂨 Card of 8|🂣 Card of 3|🂩 Card of 9|🂤 Card of 4|🃏 Joker|🂢 Card of 2|🂧 Card of 7|\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|![Mion][mion]|![Satoko][satoko]|![Hanyuu][hanyuu]|![Rika][rika]|![Chie][chie]|![Rena][rena]|![Shion][shion]|![Takano][takano]|![Oryou][oryou]|![Keiichi][keiichi]|![Irie][irie]|\n|Sonozaki Mion|Houjou Satoko|Hanyuu|Furude Rika|Chie Rumiko|Ryuuguu Rena|Sonozaki Shion|Takano Miyo|Sonozaki Oryou|Maebara Keiichi|Kyosuke Irie|\n\n> Most of the characters you see above are not yet finalized.\n\nI am quite happy with majority of the results so far. Despite the fact that I still find coloring quite challenging.\n\n<h3 id=\"slow-pace\"> Why the Slow Pace? 🦥 </h3>\n\nRecently, I've started experimenting with different ways of coloring/shading my characters, which greatly slowed down my pace. I probably redrew *specifically Mion's hair* at least 5 times.\n\n|First Iteration|Second Iteration|Third Iteration|Fourth Iteration|\n|:---:|:---:|:---:|:---:|\n|![First][mion-1]|![Second][mion-2]|![Third][mion-3]|![Fourth][mion-4]|\n\nObviously, Mion wasn't the only character I altered quite a bit. **Rumiko Chie, Hanyuu, and Takano Miyo** were also altered quite drastically.\n\n<h3 id=\"afterword\"> Afterword </h3>\n\nBy the time I am finalizing this blog post, I have already *finished* drawing **Takano Miyo** and started working on **Sonozaki Oryou**. The overall pace is still consistent, and I should be done with all the characters in no time! See you later in **part 5**.\n\n<hr/>\n\n#### Short Updates\n\n> **2022/09/14** - Just finished Sonozaki Oryou! The boys line-up should go much smoother compared to girls, due to their overall basic designs.\n\n> **2022/09/21** - Maebara Keiichi is done!... Somewhat. 👍🏻\n\n> **2022/10/03** - Done with Kyosuke Irie! Took my sweet time with a bit of procrastination as well...\n\n[mion]: https://i.imgur.com/8FewsZTm.png\n[satoko]: https://i.imgur.com/Efg8h1bm.png\n[hanyuu]: https://i.imgur.com/eh0Fuj0m.png\n[rika]: https://i.imgur.com/pA77QoFm.png\n[chie]: https://i.imgur.com/ULmNf9Rm.png\n[rena]: https://i.imgur.com/GcWyYCsm.png\n[shion]: https://i.imgur.com/U7RWxaQm.png\n\n[takano]: https://i.imgur.com/i1pBt6cm.png\n[oryou]: https://i.imgur.com/3665n2Pm.png\n[keiichi]: https://i.imgur.com/VfUaU7Lm.png\n[irie]: https://i.imgur.com/xBDLhO8m.png\n\n[mion-1]: https://i.imgur.com/dx5HcS7m.png\n[mion-2]: https://i.imgur.com/kOQUCBcm.png\n[mion-3]: https://i.imgur.com/8jQjFi1m.png\n[mion-4]: https://i.imgur.com/zc4VGgCm.png"},{"slug":"2022-08-22","title":"Custom Deck of Cards Part 3","date":"Mon Aug 22 2022","image":"https://images.unsplash.com/photo-1568860161401-fc6bbea94914?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=500&h=500&q=30","content":"\n# Custom Deck of Cards Part 3 🃏\n\n<h3 id=\"current-progress\">The Current Progress ⚙️</h3>\n\nAnd here they are! All **14 sketches**, for the card deck, these include;\n\n|🂢 Card of 2|🂧 Card of 7|🂥 Card of 5|🂦 Card of 6|🂪 Card of 10|🂡 Ace|🂮 King|🂫 Jack|🂭 Queen|🂨 Card of 8|🂣 Card of 3|🂩 Card of 9|🂤 Card of 4|🃏 Joker|\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|![Keiichi][keiichi]|![Irie][irie]|![Tomitake][tomitake]|![Ooishi][ooishi]|![Satoshi][satoshi]|![Mion][mion]|![Satoko][satoko]|![Hanyuu][hanyuu]|![Rika][rika]|![Chie][chie]|![Rena][rena]|![Shion][shion]|![Takano][takano]|![Oryou][oryou]|\n|Maebara Keiichi|Kyosuke Irie|Tomitake Jirou|Kuraudo Ooishi|Houjou Satoshi|Sonozaki Mion|Houjou Satoko|Hanyuu|Furude Rika|Chie Rumiko|Ryuuguu Rena|Sonozaki Shion|Takano Miyo|Sonozaki Oryou|\n\nOver the past few months, the way I draw my characters have drastically changed, which is why I am painstakingly having a slow process with the drawings.\n\nNot to mention, I am also working on the designs of the cards. My goal is to make them as simple as possible while retaining the modern look on them. I am using [Inkscape](https://inkscape.org/) for the card designs, the UI is not that intuitive but it will have to do for this project.\n\n<h3 id=\"upcoming-post\">Upcoming Post Preview 🕵️</h3>\n\nThe images you see below are still **work in progress** and the front view contains a colored version of **Sonozaki Mion** which I don't want to reveal just yet... This is why I decided to blur both of them.\n\n|Card Front|Card Back|\n|:---:|:---:|\n|![Card_Front][cardFront]|![Card_Back][cardBack]|\n\n<h3 id=\"afterword\">Afterword</h3>\n\nAnd with that comes an end to another blog post! I would love to keep progress updates on my card deck longer, but it is kinda hard when the only changes are newly drawn characters and such. Anyways, I hope you enjoyed this short read once again... See you at the next one where I might reveal the card designs and some finished characters.\n\n---\n\n#### Short Updates\n\n> **2022/08/22** - Yeah... Uhh... During the line-art process of **Sonozaki Mion**, I may have lost track of things, and accidentally finished the whole drawing. Therefore, I will be doing the line-art and coloring process of each character at the same time!\n\n> **2022/08/24** - After hours of moving my stylus around the glass surface, I finished drawing **Houjou Satoko**! Although I hate her personality, the drawing looks way too cute. \n\n> **2022/08/26** - Damn! I am on a roll these days, already done with 3 of the characters... out of 14... Anyways, **Hanyuu** turned out pretty good! I am not a fan of coloring my drawings but lately it's been growing on me.\n\n> **2022/08/27** - And another drawing done! I finished **Furude Rika's** line-art and base colors yesterday, so I only had to shade her this morning. Coloring wise she turned out out to be best! I am planning on releasing a new blog post once I am done with coloring **Rumiko Chie** or **Sonozaki Shion**, but no promises. \n\n> **2022/08/27** - For some reason I struggled while drawing **Rumiko Chie** more than I should, I assume it is because I've been drawing non-stop for the past few days. I am planning on redrawing her hair but for now, I am not going to bother myself with it. Oh also, make sure check my [Gallery](/gallery)!\n\n> **2022/08/31** - I took a short break after drawing **Rumiko Chie**, this short rest was much needed for my creative mind to rest. Anyhow, I **sort of** finished drawing **Sonozaki Shion** and **Ryuugu Rena**, somehow those 2 drawings turned out way better than the ones I draw a few days prior, so I am planning on revisiting them and re-drawing / re-coloring certain aspects of those characters.\n\n> **2022/09/08** - Another week passed by, this week I focused on recoloring most characters, namely **Sonozaki Mion, Rumiko Chie, Furude Rika, Hanyuu and Satoko**. Other than that I finished drawing **Takano Miyo**, however, I am not that happy with the result so I might redraw her at a later date.\n\n> **2022/09/09** - Just now, I finished redrawing **Takano Miyo's**; hair, eyes, and skin. I swear this is the last short update before I reveal the first half of the characters. I've been solely focused on making my drawings as good as they can be before showcasing them! Please look forward to them!\n\n> New updates will be written on [Custom Deck of Cards Part 4](/blog/2022-09-14)\n\n[cardFront]: https://i.imgur.com/TIzTGB6m.png\n[cardBack]: https://i.imgur.com/9aOe6eSm.png\n\n[mion]: https://i.imgur.com/dy8uNChm.png\n[satoko]: https://i.imgur.com/IHEVonkm.png\n[hanyuu]: https://i.imgur.com/pItxQavm.png\n[rika]: https://i.imgur.com/lT1ED93m.png\n\n[chie]: https://i.imgur.com/5cR7Yk8m.png\n[rena]: https://i.imgur.com/xlYcwnIm.png\n[shion]: https://i.imgur.com/N2iuoC6m.png\n[takano]: https://i.imgur.com/EExSOLcm.png\n[oryou]: https://i.imgur.com/YWEfXxVm.png\n\n[keiichi]: https://i.imgur.com/cPXSxobm.png\n[irie]: https://i.imgur.com/DXhD0oom.png\n[tomitake]: https://i.imgur.com/VG0sWp1m.png\n[ooishi]: https://i.imgur.com/XyWi7Y1m.png\n[satoshi]: https://i.imgur.com/ZudaZKlm.png"},{"slug":"2022-07-10","title":"Custom Deck of Cards Part 2","date":"Sun Jul 10 2022","image":"https://images.unsplash.com/photo-1600430086946-2d9fc61bbefc?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=500&h=500&q=30","content":"\n# Custom Deck of Cards Part 2 🃏\n\n<h3 id=\"current-progress\">The Current Progress ⚙️</h3>\n\nAt last! I finished the second year of my university without any issues. This however doesn't mean I will update the card game frequently, since I still have things to do in real life. Without further ado, here are the characters I have finished so far.\n\n|🂡 Ace|🂮 King|🂫 Jack|🂭 Queen|🂨 Card of 8|🂣 Card of 3|🂩 Card of 9|🂤 Card of 4|🃏 Joker|\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|![Mion][mion]|![Satoko][satoko]|![Hanyuu][hanyuu]|![Rika][rika]|![Chie][chie]|![Rena][rena]|![Shion][shion]|![Takano][takano]|![Oryou][oryou]|\n|Sonozaki Mion|Houjou Satoko|Hanyuu|Furude Rika|Chie Rumiko|Ryuuguu Rena|Sonozaki Shion|Takano Miyo|Sonozaki Oryou|\n\nYup, 5 new drawings; **Chie**, **Rena**, **Shion**, **Takano** and **Oryou**.\n\n> **NOTE: I am aware most characters are facing left, reason being I am used to drawing heads in that position. Every sprite will be modified before the printing phase.** \n\n<hr/>\n\n<h3 id=\"my-thoughts\">My Thoughts on the Character Sketches 🤔</h3>\n\n|Character|Thoughts|\n|:---:|---|\n|Chie Rumiko| From an overall art perspective, I am not *that* happy from the outcome, her face does look cute and all, but this alone does not satisfy me. Which is why I am planning on **redrawing her**.|\n|Ryuugu Rena|The Rena you are seeing is the **second iteration**. The previous iteration looked so hideous that I hated every pixel of it. But thankfully I redrew her before the publication of this post. She does look very **adult** like, but I will probably adjust her facial structure a bit during line-art phase to make her seem a bit younger.|\n|Sonozaki Shion|Out of the bunch Shion is one of the characters that came out better than I expected, but this doesn't mean I am 100% happy with the result. Hence the reason I am planning on **redrawing her body**.|\n|Takano Miyo|To be honest, I have nothing to say about her, her sketch simply looks amazing, especially the M1911 pistol which I used **blender** to render.|\n|Sonozaki Oryou|She came out way better than I anticipated, she is the first ever old person I drew, and not going to lie but I am kind of proud of myself.|\n\n<figure>\n<img src=\"https://i.imgur.com/MUeRCDTm.png\" alt=\"M1911 model used for Takano's pistol.\"/>\n<figcaption>M1911 model used for Takano's pistol.</figcaption>\n</figure>\n\n<h3 id=\"card-sizes\">Card Sizes 📏</h3>\n\nAdditionally, I bought 2 card decks as a reference for the size.\n\n|Normal Size|Smaller Size|\n|:---:|:---:|\n|![CardBig][cardBig]|![CardSmall][cardSmall]|\n|Height: 8.7cm|Height: 8cm|\n\nBesides their obvious difference in height, they are quite similar in width. With that being said, I am leaning more towards the **smaller size** considering it's more **portable** and more **stylish**. \n\n<h3 id=\"remaining-characters\">Remaining Characters 🖌️</h3>\n\n|🂢 (Card of 2)|🂥 (Card of 5)|🂦 (Card of 6)|🂧 (Card of 7)|🂪 (Card of 10)|\n|:---:|:---:|:---:|:---:|:---:|\n|![Keiichi][keiichi]|![tomitake][tomitake]|![Ooishi][ooishi]|![Irie][irie]|![Satoshi][satoshi]|\n|Maebara Keiichi|Tomitake Jirou|Kuraudo Ooishi|Kyousuke Irie|Houjou Satoshi|\n|**Finished**|**Finished**|**Finished**|**Finished**|**Finished**|\n\n> **DISCLAIMER: The drawings above are NOT mine! They are the original sprites from the game. The images are merely a reference for the reader.**\n\nWell, I guess it is time to draw the males. I feel the most challenging ones here will be **Kuraudo Ooishi** and **Tomitake Jirou**, considering I have never drawn someone fat or muscular.\n\n<h3 id=\"afterword\">Afterword</h3>\n\nPhew, another blog post done. When I first implemented this blogs to my website, I never thought I would be *this* into writing blogs but here I am releasing 2 posts every month. Well, I hope to see you on my next blog post!\n\n----\n\n#### Short Updates\n\n> Make sure to check my [Gallery](/gallery) where I post my drawings. This page is a new addition for my website, I hope you like it!\n\n> **2022/07/21** - Drawing **Keiichi Maebara** was quite the challenge, **particularly his pose**. It took me **4 iterations** before I could actually draw a pose I approved. Anyways, I am closing in on the line-art phase of the process.\n\n> **2022/07/26** - July 10th was **Mion Sonozaki's** birthday, make sure to check the fdrawing on my [DeviantArt](https://www.deviantart.com/thejayduck/art/Mion-Sonozaki-Birthday-923781589).\n\n> **2022/08/04** - I finished **Kyosuke Irie** the yesterday, and he came out like a character out of a *Shoujo Manga*. Nonetheless, I am quite happy the way he turned out! The upcoming sketch will be **Tomitake Jirou**, if I feel productive enough he should be done by the end of this week! I will be making a new blog post when I finish drawing the remainder.\n\n> **2022/08/05** - Turns out that I felt productive immediatly after Irie's drawing. Now that I am done with **Tomitake Jirou**, it's time to tackle down the hardest one yet! **Kuraudo Ooishi**.\n\n> **2022/08/11** - Drawing **Kuraudo Ooishi** was.. quite annoying. Drawing his body was easier than I thought, but I had all sorts of issues while drawing his face, so I had to look at many reference images of **Ooishi** and drawings with similar head shapes to get the right proportions. With that being out of the way, **Houjou Satoshi** is the last character I have to sketch before the line-art process begins!\n\n> **2022/08/19** - At last! I finished **sketching** every character for the card deck.. I was planning on finishing them all once I started, though my art style wouldn't be as consistent, so I refrained from doing so. Alongside the sketch of **Houjou Satoshi** I also worked on some **prototype card designs**, they are quite simple in design yet they retain a modern look. Next progress blog will hopefully come out by the end of this week! Please look forward to it, since I am planning on showcasing all the characters and the prototype card designs before initiating the **line-art** phase of the character art!\n\n> New updates will be written on [Custom Deck of Cards Part 3](/blog/2022-08-22)\n\n[cardBig]: https://i.imgur.com/Qp3o6tem.jpg\n[cardSmall]: https://i.imgur.com/RPRYS6Om.jpg\n[m1911]: https://i.imgur.com/MUeRCDTm.png\n\n[mion]: https://i.imgur.com/dy8uNChm.png\n[satoko]: https://i.imgur.com/IHEVonkm.png\n[hanyuu]: https://i.imgur.com/pItxQavm.png\n[rika]: https://i.imgur.com/lT1ED93m.png\n\n[chie]: https://i.imgur.com/5cR7Yk8m.png\n[rena]: https://i.imgur.com/xlYcwnIm.png\n[shion]: https://i.imgur.com/N2iuoC6m.png\n[takano]: https://i.imgur.com/EExSOLcm.png\n[oryou]: https://i.imgur.com/YWEfXxVm.png\n\n[irie]: https://i.imgur.com/FHv7YsPt.png\n[keiichi]: https://i.imgur.com/zmLQFYyt.png\n[ooishi]: https://i.imgur.com/GvDxBhxt.png\n[satoshi]: https://i.imgur.com/3TAQtHdt.png\n[tomitake]: https://i.imgur.com/kWESJA7t.png"},{"slug":"2022-06-15","title":"Our GoedWare Game Jam Entry 🎮","date":"Wed Jun 15 2022","image":"https://images.unsplash.com/photo-1550745165-9bc0b252726f?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=500&h=500&q=30","content":"\n# GoedWare Game Jam Entry 🎮\n\n<h3 id=\"the-gamejam\">The Entry ✨</h3>\n\nOn June 4th my friends and I decided to participate in [GoedWare Game Jam #5](https://itch.io/jam/goedware-game-jam-5). The last game jam I joined was [Winter VN Jam 2020](https://itch.io/jam/winter-vn-jam-2020/rate/826293). As the name suggests its been almost **2 years** since I've participated in a game jam. Although my role was minor compared to what I did in my previous entries, I had plenty of fun helping with the development. For this game jam I teamed up with [nobbele](https://nobbele.dev) and [semikoder](https://www.youtube.com/channel/UCey0WKLnnYF_98GsUsiE22w) whom I haven't done any project with for the past **4 years**.\n\nThe **main theme** of the jam was **Love, Death & Robot** combined with the subtheme of **The Price of Freedom**. I will be talking about my own experience in this blog post, you can learn more about the project in our [itch.io](https://semikoder.itch.io/project-biobot) page. The whole development process went by quite smoothly, we did have some last minute bugs appear out of nowhere, which is a typical thing that happens in every game jam. After my friends solved the issues we submitted the game.\n\n----\nHere is a short description of the game from our page:\n\n> In an era in which technology develops at a rapid speed, Biobotics Technologies have introduced a mechanization program to amplify human workloads. With their system almost ready for production, they began recruiting volunteers for human trials. You are promised a large sum of money for participating in this program, but be aware, that it might come with a catch.\n----\n\n<h3 id=\"my-role\">My Role 💼</h3>\n\nAs I mentioned above, my role in this jam was minor. I **voiced a character**, **worked on some models**, **helped with some scenery** and **overall writing**. Other than that I didn't do any programming related stuff because my finals were coming up.\n\nAnyways, when it comes to voice-acting, to put it bluntly I have no experience in it. This was my first ever voice-acting performance. I had plenty of fun but it felt weird to express feelings to the things you read aloud and add a bit of character to it. The whole recording process took me around 1-2 hours and it was quite intriguing, I had to re-record certain lines 2 to 3 times to get it just right.\n\nAdditionally I haven't done any sort of modelling for the past 4 year, for this project I did work on models such as **Laser Emitter**, and a **Mirror** that reflected the laser. Unfortunately those features didn't make the cut due to time restraints.\n\n<h3 id=\"postmortem-video\">Postmortem 📼</h3>\n\nHere is a postmortem video of how our game jam went.\n<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/lzPHjSEOwVU\" title=\"I joined a Game Jam and made a Game in a Week\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<h3 id=\"afterword\"> Afterword </h3>\n\nYup another short blog, I would like to write more but I can't really do that when my role was in this project was minor. Anyhow, I hope you liked this short blog and make sure to try our [game](https://semikoder.itch.io/project-biobot)!"},{"slug":"2022-06-12","title":"A Happy Birthday to My Friend! 🎂","date":"Sun Jun 12 2022","image":"https://images.unsplash.com/photo-1513546493312-0066d7de3fd2?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=500&h=500&q=30","content":"# A Happy Birthday Present! 🎂\n\n<h3 id=\"happy-birthday\">Happy Birthday 🎊</h3>\n\nHappy 19th birthday [nobbele](https://nobbele.dev), I hope all your future dreams come true!\n\nIt should be obvious now that this post is dedicated to my friend [nobbele's](https://nobbele.dev) **19th** birthday! I've been a friend of his ever since **2017**, and I am truly grateful to have met him. In **5** years we worked on countless projects together, some were abandoned, and some were somewhat complete.\n\n[Novel Tracker][noveltracker], [Belfast Bot][belfastbot] were our biggest projects to date.\n\n<h3 id=\"birthday-project\">The Birthday Project 🎁</h3>\n\nComing up with an idea was quite easy actually, a few months ago he kept pestering me to draw a character for his [Catch the Beat](https://ctbw.nobbele.dev/) game. With the idea in mind, I started working on the rough sketch.\n\n----\n\n<img src=\"https://i.imgur.com/mGOyFAjm.png\" align=\"left\"/>\n\n#### The Initial Sketch\n\nThis was my first attempt at chibi-esque character ever. I was kinda skeptical at how the final result would look like, but it was easier than I thought.\nThe initial sketch had 2 different iterations; the issue with the first one was, that it was in a 3/4 view, which looked out of place. Luckily, the second sketch came out better than the initial one.\n\n<br clear=\"left\"/>\n\n----\n\n<img src=\"https://i.imgur.com/POKC2bEm.png\" align=\"left\"/>\n\n#### Cleaning the Sketch\n\nI then had to re-draw the sketch on a bigger canvas, to have a bit more freedom. I also refined the majority of the sketch. For some weird reason, I thought this looked acceptable. And oh boy, I don't even want to know what I thought when I started coloring it, but thankfully I came back to my senses before it was too late. Hence was the reason why I used this as a sketch for the next iteration instead.\n\n<br clear=\"left\"/>\n\n----\n\n<img src=\"https://i.imgur.com/duy96z1m.png\" align=\"left\"/>\n\n#### Drawing the Line-art\n\nAt this point the drawing was coming along nicely. Although, I've never been a fan of drawing line-art, like ever, I had to deal with it to deliver a good present I was proud of. To my surprise it came about way better than I anticipated, additionally I was going to add more line weight but decided not to complicate stuff I wasn't used to yet. Immediately after finishing the line-art, I started coloring it.\n\n<br clear=\"left\"/>\n\n----\n\n<img src=\"https://i.imgur.com/sn2TUvam.png\" align=\"left\"/>\n\n#### Coloring\n\nI hate coloring just as I hate line-art, but I had to color it whether I liked it or not. And I am glad I colored it, during the process I learned a lot of new techniques that felt right for my style. My blending technique isn't perfect yet, but hey last time I colored something was nearly a year ago (Excluding the Shiba and the Sculpture, I received some help on those.)\nAnyways, after the coloring process, I realized some errors in my drawing, and immediately opened up [Photopea](https://www.photopea.com/) to tinker on it.\n\n<br clear=\"left\"/>\n\n----\n\n<img src=\"https://i.imgur.com/H5njXcvm.png\" align=\"left\"/>\n\n#### Adjusted Colors\n\nLastly, I imported the image on [Photopea](https://www.photopea.com/) and used liquify tool to adjust its proportions and played around with the colors to further enhance its looks. And with that, the short project came to an end. \n\n<br clear=\"left\"/>\n\n----\n\nI definitely learned a lot more about coloring and other processes of art which I don't like. But the effort was worth it.\n\n<h3 id=\"final-result\">Final Result ✍🏻</h3>\n\n|Initial Sketch|Cleaned Sketch|Line-art|Colored|Adjusted|\n|----------------------|----------------------|----------------------|----------------------|----------------------|\n|![Status #1][status-1]|![Status #2][status-2]|![Status #3][status-3]|![Status #4][status-4]|![Status #5][status-5]|\n\n<h3 id=\"afterword\">Afterword</h3>\nI hope you enjoyed this short post. This post was quite difficult to put into words for me, mostly because I wasn't sure about what to write down, so I just went with the flow. I will definitely make another post on the progress of my custom card deck in the upcoming weeks or months.\n\n[noveltracker]: https://github.com/thejayduck/novel-tracker\n[belfastbot]: https://github.com/nobbele/BelfastBot\n\n[status-1]: https://i.imgur.com/mGOyFAjm.png\n[status-2]: https://i.imgur.com/POKC2bEm.png\n[status-3]: https://i.imgur.com/duy96z1m.png\n[status-4]: https://i.imgur.com/sn2TUvam.png\n[status-5]: https://i.imgur.com/H5njXcvm.png"},{"slug":"2022-05-21","title":"Custom Deck of Cards Part 1","date":"Sat May 21 2022","image":"https://images.unsplash.com/photo-1529480653440-0e5fd1af911c?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=500&h=500&q=30","content":"# Custom Deck of Cards Part 1 🃏\n\n<h3 id=\"why-i-am-doing-this\">Why I am Doing This ❓</h3>\n\nWhy not? I mean, just the thought of having a physical something made by **you** is an amazing feeling in my opinion. I get to work on a new form of project and also, I can use this project as an excuse to improve my art.\n\n<h3 id=\"what-inspired-me\">What Inspired Me? 🤔</h3>\n\n<!-- During the development of the Tamagochi game, my friends and I decided to print a dress-up sticker set of the dog with some in-game clothing. And that re-embarked my obsession with physical copies of projects I work on. Throughout my high school years, I used to print out some of the drawings I made onto sticker paper, and give them to my friends. This time I am planning on making a deck of cards with drawings of my own. -->\n\nThis whole idea of making my own card deck arose when I started playing card games such as **Uno** more often.\nAnother factor that helped me is during the development of the Tamagochi game, my friends and I decided to print a dress-up sticker set of the dog with some in-game clothing. And with that my passion for for physical objects of projects I work on was re-embarked.\n\nBut before I actually decided on a card game however, I thought about printing a custom laptop sticker, but I quickly scrapped that idea because, it would just ruin the aesthetic of my laptop and I had already printed more than enough stickers in the past.\nAfter spending more time thinking about what I could possibly bring into the real-world, I thought about working on my own card deck. Reason being, they are cheap to produce and I just needed to draw a crap load of characters.\n\n<br/>\n\nAs for what I was going to draw, I first thought about drawing original characters, however in my case, I prefer drawing a different character every time I draw something new, hence I never settle on a character that I can actually call 'original'. With this issue on hand, I decided to draw the cast of Higurashi characters. You might ask; \"But why?\", and I genuinely have no clue why, maybe it's because I'm too invested in the story for the past few months, or maybe it's because I can't think of any other characters to draw about.\n\n<h3 id=\"current-progress\">Current Progress 📊</h3>\n\nThe deck will consist a set of 52+1 playing cards and a joker card. In total 13+1 characters. Each character except the joker will be printed 4 times.\n\n<br/>\n\nSo far, I roughly sketched out 4 characters, these include;\n\n|🂡 Ace          |🂮 King           |🂫 Jack           |🂭 Queen      |\n|:---------------:|:-----------------:|:-----------------:|:-------------:|\n| ![Mion][mion]  |![Satoko][satoko]|![Hanyuu][hanyuu]|![Rika][rika] |\n|Sonozaki Mion  |Houjou Satoko    |Hanyuu           |Furude Rika  |\n\n> **NOTE: The images are resized, the original resolution is around 1200x2000.**\n\n<br/>\n\nI am also planning on adding characters such as;\n\n| 🂢 (Card of 2)|🂣 (Card of 3)|🂤 (Card of 4)|🂥 (Card of 5)|🂦 (Card of 6)|🂧 (Card of 7)|🂨 (Card of 8)|🂩 (Card of 9)|🂪 (Card of 10)|🃏 (Joker)|\n|:---------------:|:------------:|:-----------:|:--------------:|:--------------:|:--------------:|:-----------:|:--------------:|:--------------:|:--------------:|\n| ![Keiichi][keiichi]|![Rena][rena]|![Takano][takano]|![tomitake][tomitake]|![Ooishi][ooishi]|![Irie][irie]|![Chie][chie]|![Shion][shion]|![Satoshi][satoshi]|![Oryou][oryou] |\n|Maebara Keiichi|Ryuuguu Rena|Takano Miyo|Tomitake Jirou|Kuraudo Ooishi|Kyousuke Irie|Chie Rumiko|Sonozaki Shion|Houjou Satoshi|Sonozaki Oryou|\n|**Finished**|**Finished**|**Finished**|**Finished**|**Finished**|**Finished**|**Finished**|**Finished**|**Finished**|**Finished**|\n\n> **DISCLAIMER: The drawings above are NOT mine! They are the original sprites from the game. The images are merely a reference for the reader.**\n\n<br/>\n\nThe card each character will represent is already decided, but I might tweak some of them before the printing phase.\n\n<h3 id=\"other-requirements\">Other Requirements 📝</h3>\n\nAt the moment I am planning on making the cards the size of mini playing cards, the reason being, that they are smaller and more portable than regular poker cards.\nAnd so I searched around the internet until stumbled upon this amazing **[playing card template](https://www.magicianmasterclass.com/post/playing-card-template)** that provides high-quality card templates.\n\nFor the choice of materials, I settled on, **350gr paper with rounded edges, matte coated surface, and size of 5.4cm x 8cm**.\n\nAs for casing, my initial plan was to have a standard paper box, but one of my friends suggested that I use a custom printed plastic case instead. With that thought in mind I found some outstanding free 3D printable models from **[Cults3D](https://cults3d.com/en)**. Additionally, I will edit the model of my choice to engrave a custom Higurashi logo on it.\n\n<h3 id=\"afterword\">Afterword</h3>\n\nI wasn't planning on writing another blog post so soon and this long, but for some reason, I feel the need to write these, even though I know almost no one except 2 of my friends read them. Even if that is indeed the case I am happy to be able to write these posts on occasion. Thank you once again for reading this blog post, I will probably write another or update this one when I draw more characters. See you later 👋🏻!\n\n----\n\n#### Short Updates\n\n> **2022/05/21** - I am well aware the update to the post happened earlier than I expected, but I just finished the rough sketch of **Chie Rumiko**. She came out cuter than I thought. I am planning on showcasing the new characters in the upcoming progress update.\n\n> **2022/05/22** - Wow, another update! I just finished the sketch of **Ryuuguu Rena**. Next in line is **Sonozaki Shion**. If everything goes smoothly or I am not lazy, I should have a finished sketch of her in the upcoming week.\n\n> **2022/05/28** - Phew, I guess I am done with **Shion Sonozaki**. I am not super happy of the sketch, but this will do for now, I might redraw her if I feel like it. Next in line is **Takano Miyo**.\n\n> **2022/06/02** - Drawing **Takano Miyo** was enjoyable, I am particularly pleased with her eye and overall expression. Also the last female on the deck is **Sonozaki Oryou**. In all honesty, I've never drawn an old person in my life, and I feel like everything's going to go wrong, but I will try my best to make her look somewhat good. When I finish drawing Oryou I will post a blog post showcasing all 9 characters I sketched so far.\n\n> **2022/06/19** - I am finally free from my exams! I am not planning to focus on this project 100% since I still have other stuff to work on aside from this small project. Anyways, I finally finished the sketch for **Sonozaki Oryou**. This time I will definitely write a new blog post regarding the new characters. \n\n> New updates will be written on [Custom Deck of Cards Part 2](/blog/2022-07-10)\n\n[mion]: https://i.imgur.com/dy8uNChm.png\n[satoko]: https://i.imgur.com/IHEVonkm.png\n[hanyuu]: https://i.imgur.com/pItxQavm.png\n[rika]: https://i.imgur.com/lT1ED93m.png\n\n[chie]: https://i.imgur.com/W9rj2btt.png\n[irie]: https://i.imgur.com/FHv7YsPt.png\n[keiichi]: https://i.imgur.com/zmLQFYyt.png\n[ooishi]: https://i.imgur.com/GvDxBhxt.png\n[oryou]: https://i.imgur.com/DrCV3dQt.png\n[rena]: https://i.imgur.com/TnknLqLt.png\n[satoshi]: https://i.imgur.com/3TAQtHdt.png\n[shion]: https://i.imgur.com/nTA2nDCt.png\n[takano]: https://i.imgur.com/Jca5nKft.png\n[tomitake]: https://i.imgur.com/kWESJA7t.png"},{"slug":"2022-05-15","title":"I Wrote My First Story","date":"Sun May 15 2022","image":"https://images.unsplash.com/photo-1592819695396-064b9572a660?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=500&h=500&q=30","content":"# I Wrote My First Story 📕\n\n<h3 id=\"why-i-started-writing\">Why I Started Writing ❓</h3>\n\nI consider myself a bookworm, especially when it comes to Japanese light novels. The unique stories authors in East Asia come up with always amazed me. I have to agree that some of the books they write are simply... weird to put in simple terms, but out of the bunch, some gems shine through.\nI've especially been obsessed with **Jobless Reincarnation** light novel that I read all 15 volumes within three months.\n\n<img src=\"https://i.imgur.com/hsekiOm.jpg\" width=\"150px\" alt=\"Mushoku Tensei Volume 1 Cover\" align=\"left\" />\n\nThe way the author expands on its already amazing world, and characters simply astonished me.\nAnyways back to the topic, after years of procrastinating on writing, I finally took my first step to improve my writing abilities by writing a... **fanfic**. Before you leave, no I did not write anything weird or sexual, I simply wanted to create a simple romantic spin-off of the series **Higurashi**. The reason I chose Higurashi is that one can create their own; Horror, Mystery, and Romance story with it. And with its already amazing cast of characters, it saves the person time to focus more on the plot of their spin-off.\n\n<br clear=\"left\"/>\n\n<h3 id=\"what-i-have-learned-during-the-past-week\">What I Have Learned during the Past Week ✍🏻</h3>\n\nFor the short story, I challenged myself to write it within a week! And let me tell you, it was quite the ride that I am willing to take several more times. I had so much fun writing their specific character traits on paper, which allowed me to learn so much within the deadline I had set myself up to.\nI now have a deeper understanding of how each character reacts to certain situations, and with each other. The story has a lot of flaws, and they are to be expected, that's why I asked 2 of my close friends to read it once I was done with it. They both gave me their criticism on it, which I profoundly appreciate. Although writing is not going to be my future career, I will keep improving myself with more short stories before meddling with original stories of my own. \n\n\n<h3 id=\"afterword\">Afterword</h3>\n\nThank you for reading through my first ever blog post. I am planning on writing more posts in the upcoming months, or even weeks. See you later 👋🏻!"}]},"__N_SSG":true}