{"pageProps":{"posts":[{"slug":"2022-05-15","title":"I Wrote My First Story","date":"Sun May 15 2022","image":"https://images.unsplash.com/photo-1592819695396-064b9572a660?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=500&h=500&q=30","content":"# I Wrote My First Story 📕\n\n### Why I Started Writing ❓\nI consider myself a bookworm, especially when it comes to Japanese light novels. The unique stories authors in East Asia come up with always amazed me. I have to agree that some of the books they write are simply... weird to put in simple terms, but out of the bunch, some gems shine through.\nI've especially been obsessed with **Jobless Reincarnation** light novel that I read all 15 volumes within three months.\n\n<img src=\"https://i.imgur.com/hsekiOm.jpg\" width=\"150px\" />\n\nThe way the author expands on its already amazing world, and characters simply astonished me.\nAnyways back to the topic, after years of procrastinating on writing, I finally took my first step to improve my writing abilities by writing a... **fanfic**. Before you leave, no I did not write anything weird or sexual, I simply wanted to create a simple romantic spin-off of the series **Higurashi**. The reason I chose Higurashi is that one can create their own; Horror, Mystery, and Romance story with it. And with its already amazing cast of characters, it saves the person time to focus more on the plot of their spin-off.\n\n### What I Have Learned during the Past Week ✍🏻\nFor the short story, I challenged myself to write it within a week! And let me tell you, it was quite the ride that I am willing to take several more times. I had so much fun writing their specific character traits on paper, which allowed me to learn so much within the deadline I had set myself up to.\nI now have a deeper understanding of how each character reacts to certain situations, and with each other. The story has a lot of flaws, and they are to be expected, that's why I asked 2 of my close friends to read it once I was done with it. They both gave me their criticism on it, which I profoundly appreciate. Although writing is not going to be my future career, I will keep improving myself with more short stories before meddling with original stories of my own. \n\n### Afterword \nThank you for reading through my first ever blog post. I am planning on writing more posts in the upcoming months, or even weeks. See you later 👋🏻!"}]},"__N_SSG":true}